//=============================================================================
// Yanfly Engine Plugins - Base Troop Events
// YEP_BaseTroopEvents.js
// Version: 1.00
// translation: Xeltine
//=============================================================================

var Imported = Imported || {};
Imported.YEP_BaseTroopEvents = true;

var Yanfly = Yanfly || {};
Yanfly.BTE = Yanfly.BTE || {};

//=============================================================================
/*:
 * @plugindesc 全ての敵グループで発生する戦闘イベントを設定します。
 * @author Yanfly Engine Plugins
 *
 * @param Base Troop ID
 * @desc イベントを登録するベースの敵グループIDを設定します。
 * @default 1
 *
 * @help
 * ============================================================================
 * 概要
 * ============================================================================
 *
 * ベースの敵グループに登録したイベントは全ての戦闘で実行されます。これによって
 * お決まりの処理を登録する手間が省け、制作時間が節約できます。
 */
//=============================================================================

